src/toir_cf/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладах</name>
  <resources>
    <name>ВНаличии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КонтролироватьОстатки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cf/src/AccumulationRegisters/торо_ТоварыНаРуках/торо_ТоварыНаРуках.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>торо_ТоварыНаРуках</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЗаказНаВнутреннееПотребление</name>
    <type>
      <types>DocumentRef.ЗаказНаВнутреннееПотребление</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/toir_cf/src/Documents/ВнутреннееПотреблениеТоваров/ВнутреннееПотреблениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВнутреннееПотреблениеТоваров</name>
  <basedOn>Document.ЗаказНаВнутреннееПотребление</basedOn>
  <basedOn>Document.торо_РезервПодВнутреннийЗаказ</basedOn>
  <registerRecords>AccumulationRegister.торо_ТоварыНаРуках</registerRecords>
  <registerRecords>AccumulationRegister.проф_ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.проф_ОстатокТМЦКСписаниюПоЗакрытымАктамНаРемонт</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.торо_РезервыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.торо_РезервыНаРуках</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыНаВнутреннееПотребление</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказНаВнутреннееПотребление</name>
    <type>
      <types>DocumentRef.ЗаказНаВнутреннееПотребление</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРаспоряжения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПотреблениеПоЗаказам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьРасхождения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>торо_Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>проф_НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.проф_НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>проф_ДокументОснование</name>
    <type>
      <types>DocumentRef.торо_ЗаявкаНаРемонт</types>
    </type>
  </attributes>
  <attributes>
    <name>проф_ЗаказДляЗакупки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>проф_ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.проф_ХозяйственнаяОперация</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <comment>Код строки заказа</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказНаВнутреннееПотребление</name>
      <type>
        <types>DocumentRef.ЗаказНаВнутреннееПотребление</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>проф_Назначение</name>
      <type>
        <types>CatalogRef.проф_Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>проф_КатегорииЭксплуатации</name>
      <type>
        <types>CatalogRef.проф_КатегорииЭксплуатации</types>
      </type>
    </attributes>
    <attributes>
      <name>проф_ФизическоеЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>проф_ИнвентарныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>11</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/toir_cf/src/CommonModules/торо_СтатистикаПотребления/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Функция РасчитатьСтатистикуПоАгрегатнойФункции(АгрегатнаяФункция, ДатаУстановки, СписокНоменклатуры, Склад = Неопределено, УчитыватьСклад = Истина) Экспорт
	
	ЗначениеКонстанты = Константы.торо_ПериодРасчетаСтатистикиПотребления.Получить();
	ГодНачалаОтсчета = Формат(Год(ДатаУстановки)-(ЗначениеКонстанты-1),"ЧГ=");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ТоварыНаСкладахОбороты.Период, МЕСЯЦ) КАК Период,
	|	ТоварыНаСкладахОбороты.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОбороты.Характеристика КАК Характеристика,
	|	ТоварыНаСкладахОбороты.Склад КАК Склад,
	|	СУММА(ТоварыНаСкладахОбороты.ВНаличииРасход) КАК СуммаРасход
	|ПОМЕСТИТЬ ВТ_ДанныеПоМесяцам
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Обороты(ДАТАВРЕМЯ("+ГодНачалаОтсчета+",1, 1),
	|				КОНЕЦПЕРИОДА(&ДатаУстановки,МЕСЯЦ),
	|				Регистратор,
	|				Номенклатура В (&СписокНоменклатуры)
	|				И (&НеИспользоватьОтборПоСкладу
	|					ИЛИ Склад = &Склад)) КАК ТоварыНаСкладахОбороты
	|ГДЕ
	|	МЕСЯЦ(ТоварыНаСкладахОбороты.Период) = &Период
	|	И ТИПЗНАЧЕНИЯ(ТоварыНаСкладахОбороты.Регистратор) = ТИП(Документ.ВнутреннееПотреблениеТоваров)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ТоварыНаСкладахОбороты.Период, МЕСЯЦ),
	|	ТоварыНаСкладахОбороты.Номенклатура,
	|	ТоварыНаСкладахОбороты.Характеристика,
	|	ТоварыНаСкладахОбороты.Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ТоварыНаРукахОбороты.Период, МЕСЯЦ) КАК Период,
	|	ТоварыНаРукахОбороты.Номенклатура КАК Номенклатура,
	|	ТоварыНаРукахОбороты.Характеристика КАК Характеристика,
	|	ТоварыНаРукахОбороты.Склад,
	|	СУММА(ТоварыНаРукахОбороты.КоличествоРасход) КАК СуммаРасход
	|ИЗ
	|	РегистрНакопления.торо_ТоварыНаРуках.Обороты(ДАТАВРЕМЯ("+ГодНачалаОтсчета+",1, 1),
	|				КОНЕЦПЕРИОДА(&ДатаУстановки,МЕСЯЦ),
	|				Регистратор,
	|				Номенклатура В (&СписокНоменклатуры)
	|				И (&НеИспользоватьОтборПоСкладу
	|					ИЛИ Склад = &Склад)) КАК ТоварыНаРукахОбороты
	|ГДЕ
	|	МЕСЯЦ(ТоварыНаРукахОбороты.Период) = &Период
	|	И ТИПЗНАЧЕНИЯ(ТоварыНаРукахОбороты.Регистратор) = ТИП(Документ.ВнутреннееПотреблениеТоваров)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ТоварыНаРукахОбороты.Период, МЕСЯЦ),
	|	ТоварыНаРукахОбороты.Номенклатура,
	|	ТоварыНаРукахОбороты.Характеристика,
	|	ТоварыНаРукахОбороты.Склад
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеПоМесяцам.Номенклатура КАК Номенклатура,
	|	ВТ_ДанныеПоМесяцам.Номенклатура.ЕдиницаИзмерения.торо_ОкруглятьПриРасчетеСтатистики КАК ОкруглятьКоличество,
	|	ВТ_ДанныеПоМесяцам.Характеристика КАК Характеристика,
	|	ВТ_ДанныеПоМесяцам.Склад,
	|	"+АгрегатнаяФункция+"(ВТ_ДанныеПоМесяцам.СуммаРасход) КАК СуммаРасход
	|ИЗ
	|	ВТ_ДанныеПоМесяцам КАК ВТ_ДанныеПоМесяцам
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеПоМесяцам.Номенклатура,
	|	ВТ_ДанныеПоМесяцам.Склад,
	|	ВТ_ДанныеПоМесяцам.Характеристика";
	
	Если Склад = Неопределено Тогда
		Запрос.УстановитьПараметр("НеИспользоватьОтборПоСкладу", Истина);
	Иначе
		Запрос.УстановитьПараметр("НеИспользоватьОтборПоСкладу", Ложь);
	КонецЕсли;
	
	Если УчитыватьСклад = Ложь Тогда 
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"ВТ_ДанныеПоМесяцам.Склад,","");
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Склад",Склад);
	Запрос.УстановитьПараметр("ДатаУстановки",ДатаУстановки);
	Запрос.УстановитьПараметр("Период",Месяц(ДатаУстановки));
	Запрос.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);
	
	Если ЗначениеЗаполнено(ЗначениеКонстанты) Тогда	
		Возврат Запрос.Выполнить().Выгрузить();	
	КонецЕсли;	
	
КонецФункции	

Функция РасчитатьСтатистикуПоПрошломуГоду(ДатаУстановки,СписокНоменклатуры,Склад = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ТоварыНаСкладахОбороты.Период, МЕСЯЦ) КАК Период,
	|	ТоварыНаСкладахОбороты.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОбороты.Характеристика КАК Характеристика,
	|	СУММА(ТоварыНаСкладахОбороты.ВНаличииРасход) КАК СуммаРасход,
	|	ТоварыНаСкладахОбороты.Склад КАК Склад
	|ПОМЕСТИТЬ ВТ_ДанныеПоМесяцам
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Обороты(
	|			НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаУстановки, ГОД, -1), ГОД),
	|			КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаУстановки, ГОД, -1), ГОД),
	|			Регистратор,
	|			Номенклатура В (&СписокНоменклатуры)
	|				И (&НеИспользоватьОтборПоСкладу
	|					ИЛИ Склад = &Склад)) КАК ТоварыНаСкладахОбороты
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ТоварыНаСкладахОбороты.Регистратор) = ТИП(Документ.ВнутреннееПотреблениеТоваров)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ТоварыНаСкладахОбороты.Период, МЕСЯЦ),
	|	ТоварыНаСкладахОбороты.Номенклатура,
	|	ТоварыНаСкладахОбороты.Характеристика,
	|	ТоварыНаСкладахОбороты.Склад
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ТоварыНаРукахОбороты.Период, МЕСЯЦ),
	|	ТоварыНаРукахОбороты.Номенклатура,
	|	ТоварыНаРукахОбороты.Характеристика,
	|	СУММА(ТоварыНаРукахОбороты.КоличествоРасход),
	|	ТоварыНаРукахОбороты.Склад
	|ИЗ
	|	РегистрНакопления.торо_ТоварыНаРуках.Обороты(
	|			НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаУстановки, ГОД, -1), ГОД),
	|			КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(&ДатаУстановки, ГОД, -1), ГОД),
	|			Регистратор,
	|			Номенклатура В (&СписокНоменклатуры)
	|				И (&НеИспользоватьОтборПоСкладу
	|					ИЛИ Склад = &Склад)) КАК ТоварыНаРукахОбороты
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(ТоварыНаРукахОбороты.Регистратор) = ТИП(Документ.ВнутреннееПотреблениеТоваров)
	|
	|СГРУППИРОВАТЬ ПО
	|	НАЧАЛОПЕРИОДА(ТоварыНаРукахОбороты.Период, МЕСЯЦ),
	|	ТоварыНаРукахОбороты.Номенклатура,
	|	ТоварыНаРукахОбороты.Характеристика,
	|	ТоварыНаРукахОбороты.Склад
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеПоМесяцам.Номенклатура КАК Номенклатура,
	|	ВТ_ДанныеПоМесяцам.Характеристика КАК Характеристика,
	|	СУММА(ВТ_ДанныеПоМесяцам.СуммаРасход) КАК СуммаРасход
	|ПОМЕСТИТЬ ВТ_СОбщейСуммой
	|ИЗ
	|	ВТ_ДанныеПоМесяцам КАК ВТ_ДанныеПоМесяцам
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ДанныеПоМесяцам.Номенклатура,
	|	ВТ_ДанныеПоМесяцам.Характеристика
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура,
	|	Характеристика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеПоМесяцам.Номенклатура КАК Номенклатура,
	|	ВТ_ДанныеПоМесяцам.Номенклатура.ЕдиницаИзмерения.торо_ОкруглятьПриРасчетеСтатистики КАК ОкруглятьКоличество,
	|	ВТ_ДанныеПоМесяцам.Характеристика КАК Характеристика,
	|	ВТ_ДанныеПоМесяцам.СуммаРасход КАК КоличествоРасход,
	|	ВТ_ДанныеПоМесяцам.Склад КАК Склад,
	|	ВТ_СОбщейСуммой.СуммаРасход / 12 КАК СреднееЗаМесяц,
	|	ВТ_СОбщейСуммой.СуммаРасход КАК ОбщийРасход
	|ИЗ
	|	ВТ_ДанныеПоМесяцам КАК ВТ_ДанныеПоМесяцам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СОбщейСуммой КАК ВТ_СОбщейСуммой
	|		ПО ВТ_ДанныеПоМесяцам.Номенклатура = ВТ_СОбщейСуммой.Номенклатура
	|			И ВТ_ДанныеПоМесяцам.Характеристика = ВТ_СОбщейСуммой.Характеристика";
		
	Если Склад = Неопределено Тогда
		Запрос.УстановитьПараметр("НеИспользоватьОтборПоСкладу", Истина);
	Иначе
		Запрос.УстановитьПараметр("НеИспользоватьОтборПоСкладу", Ложь);
	КонецЕсли;
		
	Запрос.УстановитьПараметр("Склад",Склад);		
	Запрос.УстановитьПараметр("Период",Месяц(ДатаУстановки));
	Запрос.УстановитьПараметр("ДатаУстановки",ДатаУстановки);
	Запрос.УстановитьПараметр("СписокНоменклатуры",СписокНоменклатуры);
	
	Возврат Запрос.Выполнить().Выгрузить();
		
КонецФункции

#КонецОбласти
